; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob75) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 - pallet
	crate0 crate1 crate2 crate3 crate4 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 - hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate0)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate4)
	(at pallet5 distributor2)
	(clear crate2)
	(at pallet6 depot1)
	(clear pallet6)
	(at pallet7 depot2)
	(clear pallet7)
	(at pallet8 distributor1)
	(clear crate3)
	(at pallet9 distributor0)
	(clear pallet9)
	(at pallet10 distributor0)
	(clear pallet10)
	(at pallet11 distributor1)
	(clear crate1)
	(at truck0 depot1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 317)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 308)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot2)
	(available hoist6)
	(at hoist7 distributor0)
	(available hoist7)
	(at crate0 depot1)
	(on crate0 pallet1)
	(= (weight crate0) 18)
	(at crate1 distributor1)
	(on crate1 pallet11)
	(= (weight crate1) 43)
	(at crate2 distributor2)
	(on crate2 pallet5)
	(= (weight crate2) 72)
	(at crate3 distributor1)
	(on crate3 pallet8)
	(= (weight crate3) 2)
	(at crate4 distributor1)
	(on crate4 pallet4)
	(= (weight crate4) 51)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet6)
		(on crate2 pallet10)
		(on crate3 pallet1)
		(on crate4 pallet11)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist5 crate2 pallet5 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist5) (on crate2 pallet5)
   added: (lifting hoist5 crate2) (clear pallet5)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 4
2. (lift hoist1 crate0 pallet1 depot1)
   deleted: (at crate0 depot1) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 4
3. (drop hoist1 crate0 pallet6 depot1)
   deleted: (lifting hoist1 crate0) (clear pallet6)
   added: (available hoist1) (at crate0 depot1) (clear crate0) (on crate0 pallet6)
   goals met: 1 of 4
4. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 2 to 12
   goals met: 1 of 4
5. (load hoist5 crate2 truck0 distributor2)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck0) (available hoist5)
   changed: (current_load truck0) from 0 to 72
   goals met: 1 of 4
6. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 12 to 22
   goals met: 1 of 4
7. (lift hoist4 crate3 pallet8 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist4) (on crate3 pallet8)
   added: (lifting hoist4 crate3) (clear pallet8)
   changed: (fuel-cost) from 22 to 23
   goals met: 1 of 4
8. (load hoist4 crate3 truck0 distributor1)
   deleted: (lifting hoist4 crate3)
   added: (in crate3 truck0) (available hoist4)
   changed: (current_load truck0) from 72 to 74
   goals met: 1 of 4
9. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 23 to 33
   goals met: 1 of 4
10. (unload hoist3 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist3)
   added: (lifting hoist3 crate2)
   changed: (current_load truck0) from 74 to 2
   goals met: 1 of 4
11. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 33 to 43
   goals met: 1 of 4
12. (unload hoist1 crate3 truck0 depot1)
   deleted: (in crate3 truck0) (available hoist1)
   added: (lifting hoist1 crate3)
   changed: (current_load truck0) from 2 to 0
   goals met: 1 of 4
13. (drop hoist3 crate2 pallet10 distributor0)
   deleted: (lifting hoist3 crate2) (clear pallet10)
   added: (available hoist3) (at crate2 distributor0) (clear crate2) (on crate2 pallet10)
   goals met: 2 of 4
14. (drop hoist1 crate3 pallet1 depot1)
   deleted: (lifting hoist1 crate3) (clear pallet1)
   added: (available hoist1) (at crate3 depot1) (clear crate3) (on crate3 pallet1)
   goals met: 3 of 4
15. (lift hoist4 crate1 pallet11 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist4) (on crate1 pallet11)
   added: (lifting hoist4 crate1) (clear pallet11)
   changed: (fuel-cost) from 43 to 44
   goals met: 3 of 4
16. (drop hoist4 crate1 pallet8 distributor1)
   deleted: (lifting hoist4 crate1) (clear pallet8)
   added: (available hoist4) (at crate1 distributor1) (clear crate1) (on crate1 pallet8)
   goals met: 3 of 4
17. (lift hoist4 crate4 pallet4 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist4) (on crate4 pallet4)
   added: (lifting hoist4 crate4) (clear pallet4)
   changed: (fuel-cost) from 44 to 45
   goals met: 3 of 4
18. (drop hoist4 crate4 pallet11 distributor1)
   deleted: (lifting hoist4 crate4) (clear pallet11)
   added: (available hoist4) (at crate4 distributor1) (clear crate4) (on crate4 pallet11)
   goals met: 4 of 4
